app/controllers/messages_controller.rb

SELECT * FROM `messages`
---
  def index
    @messages = Message.all

SELECT * FROM `messages` WHERE (`messages`.`id` = 1)
---
  def show
    @message = Message.find(params[:id])

INSERT INTO `messages` (`created_at`, `body`, `updated_at`, `user_id`, `user_agent`) VALUES('2009-12-10 15:46:53', 'test', '2009-12-10 15:46:53', 0, 'user agent')
---
  def create
    @message = Message.new(params[:message])
    @message.user_agent = request.env["HTTP_USER_AGENT"].split(" ").first
    @message.user_id = current_user.id
    respond_to do |format|
      if @message.save

SELECT * FROM `messages` WHERE (`messages`.`id` = 1)
DELETE FROM `messages` WHERE `id` = 1
---
  def destroy
    @message = Message.find(params[:id])
    @message.destroy