app/controllers/users_controller.rb

INSERT INTO `users` (`created_at`, `single_access_token`, `last_request_at`, `crypted_password`, `updated_at`, `perishable_token`, `failed_login_count`, `current_login_ip`, `password_salt`, `current_login_at`, `persistence_token`, `login_count`, `last_login_ip`, `login`, `last_login_at`, `email`) VALUES('2009-12-03 15:39:52', 'ZzvRvzHw9Op91U5l_xAd', '2009-12-03 15:39:52', '79c45c47f081970f6b5dc3b0b6fd881725cffcf3fec0278d732b1e119ec778f2e1a9e17c3e55f8c0ad6bdc085e12df28f5e447e9758f1d75395abe978c0d93f0', '2009-12-03 15:39:52', 'boayQQp7ts_EV2nvyW57', 0, '130.79.7.1', '4E1M3mcdd493n46pYEqd', '2009-12-03 15:39:52', '76eb48aa15da2eee2d63a26ef6f09d471c481074aa6b72f928e3f315546e093d2ee86c673440bfab974559659e99350258f99015fca3ac25399b64f3f0a279f3', 1, NULL, 'nicolas', NULL, 'zinger.nicolas@orange.fr')
---
  def create
    @user = User.new(params[:user])
    if @user.save

SELECT * FROM `users` WHERE (`users`.`login` = 'nicolas') LIMIT 1
SELECT * FROM `messages` WHERE (`messages`.user_id = 1) ORDER BY messages.updated_at DESC LIMIT 0, 5
SELECT count(*) AS count_all FROM `messages` WHERE (`messages`.user_id = 1)
UPDATE `users` SET `updated_at` = '2009-12-03 15:39:52', `perishable_token` = '1dNm8sVx1TVxomc8qEM_', `last_request_at` = '2009-12-03 15:39:52' WHERE `id` = 1
---
   def show
     #@user = @current_user
     @user = User.find_by_login params[:id]
     @messages = @user.messages.paginate :page => params[:page], :per_page => 5, :order => 'messages.updated_at DESC'

SELECT * FROM `messages` ORDER BY messages.updated_at DESC LIMIT 0, 5
SELECT count(*) AS count_all FROM `messages`
---
    def index
     @messages = Message.paginate :page => params[:page], :per_page => 5, :order => 'messages.updated_at DESC'